# PANDAS IN PYTHON

##### Pandas is an open source data analysis and manipulation library for python. it provides data structue and functions needed to work with structured data seamlessly and intuitively. the  primary data structure in pandas are:
   #### 1. series : A one-dimentional labeled array capable of holding any data type
   #### 2. DataFrame : A two-dimensional labeled data structure with columns of potentially different datatypes.

In [ ]:
# importing pandas

In [34]:
import pandas as pd

In [41]:
# creating blank series

In [40]:
import pandas as pd

# Create a blank series
blank_series = pd.Series()

print(blank_series)

Series([], dtype: object)

In [44]:
series = pd.Series([0,11,22,33,44,55,66,77,88,99])
print(series)

0     0
1    11
2    22
3    33
4    44
5    55
6    66
7    77
8    88
9    99
dtype: int64

# Creating  a dictionary

In [46]:
dictionary = {'f': [1,2,3], 'g': [4,8,9], 'h':[4,7,1]}
print(dictionary)

{'f': [1, 2, 3], 'g': [4, 8, 9], 'h': [4, 7, 1]}

# Creating a  Dataframe

In [47]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [54]:
info = {
    'name' : ['aman' , 'tom' , 'jim' , 'raj'],
    'state' : ['br' , 'gj' , 'tm', 'cn'],
    'salary' : [20000 , 30000, 49000, 5000]
}
d = pd.DataFrame(info)
print(d)

   name state  salary
0  aman    br   20000
1   tom    gj   30000
2   jim    tm   49000
3   raj    cn    5000

In [55]:
# add new column in table and add values

In [58]:
d['mobile']= "99,44,66,88".split(',')
print (d)

   name state  salary mobile
0  aman    br   20000     99
1   tom    gj   30000     44
2   jim    tm   49000     66
3   raj    cn    5000     88

In [59]:
# nan values

In [72]:
info = {
    'name' : ['aman' , 'tom' , np.nan , np.nan],
    'state' : ['br' , 'gj' , 'tm', 'cn'],
    'salary' : [20000 , 30000, 49000, np.nan]}
d = pd.DataFrame(info)
print(d)

   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2   NaN    tm  49000.0
3   NaN    cn      NaN

In [62]:
 # drop nan values // column

In [64]:
print("\n Dropping any column with nan value\n",'-'*35,sep='')
print(d.dropna(axis=1))  //

 Dropping any column with nan value
-----------------------------------
     name state
0    aman    br
1     tom    gj
2  np.nan    tm
3  np.nan    cn

In [73]:
print("\n Dropping any Rows with nan value\n",'-'*75,sep='')
print(d.dropna(axis=0))

 Dropping any Rows with nan value
---------------------------------------------------------------------------
   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0

In [74]:
# fill the position of nan with 99

In [77]:
print("\n Filling Value with 99 \t",'-'*8,sep='')
print(d.fillna(value=99))

 Filling Value with 99 	--------
   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2    99    tm  49000.0
3    99    cn     99.0

In [80]:
print("\n Filling Value with 00 \n",'-'*35,sep='')
print(d.fillna(value=00))

 Filling Value with 00
-----------------------------------
   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2     0    tm  49000.0
3     0    cn      0.0

In [81]:
print(d)

   name state   salary
0  aman    br  20000.0
1   tom    gj  30000.0
2   NaN    tm  49000.0
3   NaN    cn      NaN

In [84]:
print("\n Filling Values (mean of a column )\n",'-')
d.fillna(value=d['salary'].mean(),inplace=True)
print(d)

 Filling Values (mean of a column )
 -
      name state   salary
0     aman    br  20000.0
1      tom    gj  30000.0
2  33000.0    tm  49000.0
3  33000.0    cn  33000.0

In [85]:
 #find the mean company wise. firstly we have to group by column names using groupby

In [88]:
df = pd.DataFrame({'Animal': ['Falcon', 'Falcon',
                              'Parrot', 'Parrot'],
                   'Max Speed': [380., 370., 24., 26.]})

In [89]:
print (df)

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [93]:
df.groupby(['Animal']).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [94]:
#Concating DataFrame 
#There are Three types of concating  -1 = Concat
#                                     2  = Merge
#                                     3 =  Join

In [95]:
info =pd.DataFrame({'Mat':[45,68,35,65],
                     'Eng':[54,87,36,52],
                     'Sci':[66,77,88,70],
                     'hindi':[54,79,58,76]},
                    index=['Ravi','Shyam','Saurav','Abhi'])

In [96]:
print(info)

        Mat  Eng  Sci  hindi
Ravi     45   54   66     54
Shyam    68   87   77     79
Saurav   35   36   88     58
Abhi     65   52   70     76

In [98]:
info_2=pd.DataFrame({'Mat':[45,68,35,95],
                     'Eng':[54,87,36,54],
                     'Sci':[66,77,88,72],
                     'hindi':[66,71,5,46]},
                    index=['aman','amit','rahul','ravi'])
info_2

       Mat  Eng  Sci  hindi
aman    45   54   66     66
amit    68   87   77     71
rahul   35   36   88      5
ravi    95   54   72     46

In [100]:
info_3= pd.DataFrame({'Mat':[0,8,95,5],
                     'Eng':[64,83,6,14],
                     'Sci':[66,77,18,72],
                     'hindi':[66,71,5,46]},
                    index=['akash','ankit','tom','ai'])
info_3

       Mat  Eng  Sci  hindi
akash    0   64   66     66
ankit    8   83   77     71
tom     95    6   18      5
ai       5   14   72     46

In [101]:
# concat row

In [102]:
all_student_marks=pd.concat([info,info_2,info_3],axis=0)
print("\n After concatenation along row \n",'-'*50,sep='')
print(all_student_marks)

 After concatenation along row
--------------------------------------------------
        Mat  Eng  Sci  hindi
Ravi     45   54   66     54
Shyam    68   87   77     79
Saurav   35   36   88     58
Abhi     65   52   70     76
aman     45   54   66     66
amit     68   87   77     71
rahul    35   36   88      5
ravi     95   54   72     46
akash     0   64   66     66
ankit     8   83   77     71
tom      95    6   18      5
ai        5   14   72     46

In [103]:
# concat column

In [104]:
all_student_marks=pd.concat([info,info_2,info_3],axis=1)
print("\n After concatenation along column\n",'-'*40,sep='')
print(all_student_marks)

 After concatenation along column
----------------------------------------
         Mat   Eng   Sci  hindi   Mat   Eng   Sci  hindi   Mat   Eng   Sci  \
Ravi    45.0  54.0  66.0   54.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
Shyam   68.0  87.0  77.0   79.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
Saurav  35.0  36.0  88.0   58.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
Abhi    65.0  52.0  70.0   76.0   NaN   NaN   NaN    NaN   NaN   NaN   NaN
aman     NaN   NaN   NaN    NaN  45.0  54.0  66.0   66.0   NaN   NaN   NaN
amit     NaN   NaN   NaN    NaN  68.0  87.0  77.0   71.0   NaN   NaN   NaN
rahul    NaN   NaN   NaN    NaN  35.0  36.0  88.0    5.0   NaN   NaN   NaN
ravi     NaN   NaN   NaN    NaN  95.0  54.0  72.0   46.0   NaN   NaN   NaN
akash    NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN   0.0  64.0  66.0
ankit    NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN   8.0  83.0  77.0
tom      NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN  95.0   6.0  18.0
ai       NaN   NaN   NaN    NaN   NaN   NaN   NaN    NaN   5.0  14.0  72.0

        hindi
Ravi      NaN
Shyam     NaN
Saurav    NaN
Abhi      NaN
aman      NaN
amit      NaN
rahul     NaN
ravi      NaN
akash    66.0
ankit    71.0
tom       5.0
ai       46.0

In [105]:
 # Fill all Nan Zero

In [113]:
all_student_marks.fillna(value=0,inplace=True)
print(all_student_marks)

         Mat   Eng   Sci  hindi   Mat   Eng   Sci  hindi   Mat   Eng   Sci  \
Ravi    45.0  54.0  66.0   54.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
Shyam   68.0  87.0  77.0   79.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
Saurav  35.0  36.0  88.0   58.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
Abhi    65.0  52.0  70.0   76.0   0.0   0.0   0.0    0.0   0.0   0.0   0.0
aman     0.0   0.0   0.0    0.0  45.0  54.0  66.0   66.0   0.0   0.0   0.0
amit     0.0   0.0   0.0    0.0  68.0  87.0  77.0   71.0   0.0   0.0   0.0
rahul    0.0   0.0   0.0    0.0  35.0  36.0  88.0    5.0   0.0   0.0   0.0
ravi     0.0   0.0   0.0    0.0  95.0  54.0  72.0   46.0   0.0   0.0   0.0
akash    0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0   0.0  64.0  66.0
ankit    0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0   8.0  83.0  77.0
tom      0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0  95.0   6.0  18.0
ai       0.0   0.0   0.0    0.0   0.0   0.0   0.0    0.0   5.0  14.0  72.0

        hindi
Ravi      0.0
Shyam     0.0
Saurav    0.0
Abhi      0.0
aman      0.0
amit      0.0
rahul     0.0
ravi      0.0
akash    66.0
ankit    71.0
tom       5.0
ai       46.0

# merge

In [5]:
import pandas as pd
student_id_name=pd.DataFrame({'ID':[25823,3045,3596,4022,4511,5023,5455],
                            'Name':['aman','abhi','rock','harry','tom','Pogba','jerry']})

In [119]:
student_id_name

      ID   Name
0  25823   aman
1   3045   abhi
2   3596   rock
3   4022  harry
4   4511    tom
5   5023  Pogba
6   5455  jerry

In [6]:
print(" student details are \t ------------------")
student_id_name

 student details are 	 ------------------

      ID   Name
0  25823   aman
1   3045   abhi
2   3596   rock
3   4022  harry
4   4511    tom
5   5023  Pogba
6   5455  jerry

In [11]:
import pandas as pd
dt = pd.read_csv("matches.csv")
dt

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,05/04/17,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,06/04/17,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,2017,Indore,08/04/17,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,2017,Bangalore,08/04/17,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
631,632,2016,Raipur,22/05/16,Delhi Daredevils,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,6,V Kohli,Shaheed Veer Narayan Singh International Stadium,A Nand Kishore,BNJ Oxenford,NaN
632,633,2016,Bangalore,24/05/16,Gujarat Lions,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Royal Challengers Bangalore,0,4,AB de Villiers,M Chinnaswamy Stadium,AK Chaudhary,HDPK Dharmasena,NaN
633,634,2016,Delhi,25/05/16,Sunrisers Hyderabad,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Sunrisers Hyderabad,22,0,MC Henriques,Feroz Shah Kotla,M Erasmus,C Shamshuddin,NaN
634,635,2016,Delhi,27/05/16,Gujarat Lions,Sunrisers Hyderabad,Sunrisers Hyderabad,field,normal,0,Sunrisers Hyderabad,0,4,DA Warner,Feroz Shah Kotla,M Erasmus,CK Nandan,NaN
635,636,2016,Bangalore,29/05/16,Sunrisers Hyderabad,Royal Challengers Bangalore,Sunrisers Hyderabad,bat,normal,0,Sunrisers Hyderabad,8,0,BCJ Cutting,M Chinnaswamy Stadium,HDPK Dharmasena,BNJ Oxenford,NaN

# print starting 20 rows

In [12]:
print(dt.head(20))

    id  season       city      date                        team1  \
0    1    2017  Hyderabad  05/04/17          Sunrisers Hyderabad
1    2    2017       Pune  06/04/17               Mumbai Indians
2    3    2017     Rajkot  07/04/17                Gujarat Lions
3    4    2017     Indore  08/04/17       Rising Pune Supergiant
4    5    2017  Bangalore  08/04/17  Royal Challengers Bangalore
5    6    2017  Hyderabad  09/04/17                Gujarat Lions
6    7    2017     Mumbai  09/04/17        Kolkata Knight Riders
7    8    2017     Indore  10/04/17  Royal Challengers Bangalore
8    9    2017       Pune  11/04/17             Delhi Daredevils
9   10    2017     Mumbai  12/04/17          Sunrisers Hyderabad
10  11    2017    Kolkata  13/04/17              Kings XI Punjab
11  12    2017  Bangalore  14/04/17  Royal Challengers Bangalore
12  13    2017     Rajkot  14/04/17       Rising Pune Supergiant
13  14    2017    Kolkata  15/04/17        Kolkata Knight Riders
14  15    2017      Delhi  15/04/17             Delhi Daredevils
15  16    2017     Mumbai  16/04/17                Gujarat Lions
16  17    2017  Bangalore  16/04/17       Rising Pune Supergiant
17  18    2017      Delhi  17/04/17             Delhi Daredevils
18  19    2017  Hyderabad  17/04/17          Sunrisers Hyderabad
19  20    2017     Rajkot  18/04/17  Royal Challengers Bangalore

                          team2                  toss_winner toss_decision  \
0   Royal Challengers Bangalore  Royal Challengers Bangalore         field
1        Rising Pune Supergiant       Rising Pune Supergiant         field
2         Kolkata Knight Riders        Kolkata Knight Riders         field
3               Kings XI Punjab              Kings XI Punjab         field
4              Delhi Daredevils  Royal Challengers Bangalore           bat
5           Sunrisers Hyderabad          Sunrisers Hyderabad         field
6                Mumbai Indians               Mumbai Indians         field
7               Kings XI Punjab  Royal Challengers Bangalore           bat
8        Rising Pune Supergiant       Rising Pune Supergiant         field
9                Mumbai Indians               Mumbai Indians         field
10        Kolkata Knight Riders        Kolkata Knight Riders         field
11               Mumbai Indians               Mumbai Indians         field
12                Gujarat Lions                Gujarat Lions         field
13          Sunrisers Hyderabad          Sunrisers Hyderabad         field
14              Kings XI Punjab             Delhi Daredevils           bat
15               Mumbai Indians               Mumbai Indians         field
16  Royal Challengers Bangalore  Royal Challengers Bangalore         field
17        Kolkata Knight Riders             Delhi Daredevils           bat
18              Kings XI Punjab              Kings XI Punjab         field
19                Gujarat Lions                Gujarat Lions         field

    result  dl_applied                       winner  win_by_runs  \
0   normal           0          Sunrisers Hyderabad           35
1   normal           0       Rising Pune Supergiant            0
2   normal           0        Kolkata Knight Riders            0
3   normal           0              Kings XI Punjab            0
4   normal           0  Royal Challengers Bangalore           15
5   normal           0          Sunrisers Hyderabad            0
6   normal           0               Mumbai Indians            0
7   normal           0              Kings XI Punjab            0
8   normal           0             Delhi Daredevils           97
9   normal           0               Mumbai Indians            0
10  normal           0        Kolkata Knight Riders            0
11  normal           0               Mumbai Indians            0
12  normal           0                Gujarat Lions            0
13  normal           0        Kolkata Knight Riders           17
14  normal           0             Delhi Daredevils           51
15  normal           0               Mumbai Indians            0
16  normal           0       Rising Pune Supergiant           27
17  normal           0        Kolkata Knight Riders            0
18  normal           0          Sunrisers Hyderabad            5
19  normal           0  Royal Challengers Bangalore           21

    win_by_wickets  player_of_match  \
0                0     Yuvraj Singh
1                7        SPD Smith
2               10          CA Lynn
3                6       GJ Maxwell
4                0        KM Jadhav
5                9      Rashid Khan
6                4           N Rana
7                8         AR Patel
8                0        SV Samson
9                4        JJ Bumrah
10               8        SP Narine
11               4       KA Pollard
12               7           AJ Tye
13               0       RV Uthappa
14               0      CJ Anderson
15               6           N Rana
16               0        BA Stokes
17               4  NM Coulter-Nile
18               0          B Kumar
19               0         CH Gayle

                                        venue                umpire1  \
0   Rajiv Gandhi International Stadium, Uppal            AY Dandekar
1     Maharashtra Cricket Association Stadium         A Nand Kishore
2      Saurashtra Cricket Association Stadium            Nitin Menon
3                      Holkar Cricket Stadium           AK Chaudhary
4                       M Chinnaswamy Stadium                    NaN
5   Rajiv Gandhi International Stadium, Uppal             A Deshmukh
6                            Wankhede Stadium            Nitin Menon
7                      Holkar Cricket Stadium           AK Chaudhary
8     Maharashtra Cricket Association Stadium            AY Dandekar
9                            Wankhede Stadium            Nitin Menon
10                               Eden Gardens             A Deshmukh
11                      M Chinnaswamy Stadium  KN Ananthapadmanabhan
12     Saurashtra Cricket Association Stadium         A Nand Kishore
13                               Eden Gardens            AY Dandekar
14                           Feroz Shah Kotla               YC Barde
15                           Wankhede Stadium         A Nand Kishore
16                      M Chinnaswamy Stadium  KN Ananthapadmanabhan
17                           Feroz Shah Kotla            Nitin Menon
18  Rajiv Gandhi International Stadium, Uppal            AY Dandekar
19     Saurashtra Cricket Association Stadium                 S Ravi

          umpire2  umpire3
0        NJ Llong      NaN
1          S Ravi      NaN
2       CK Nandan      NaN
3   C Shamshuddin      NaN
4             NaN      NaN
5        NJ Llong      NaN
6       CK Nandan      NaN
7   C Shamshuddin      NaN
8          S Ravi      NaN
9       CK Nandan      NaN
10       NJ Llong      NaN
11   AK Chaudhary      NaN
12         S Ravi      NaN
13       NJ Llong      NaN
14    Nitin Menon      NaN
15         S Ravi      NaN
16  C Shamshuddin      NaN
17      CK Nandan      NaN
18     A Deshmukh      NaN
19      VK Sharma      NaN

# print last 10 rows

In [13]:
print(dt.tail(10))

      id  season           city      date                  team1  \
626  627    2016         Kanpur  19/05/16  Kolkata Knight Riders
627  628    2016         Raipur  20/05/16    Sunrisers Hyderabad
628  629    2016  Visakhapatnam  21/05/16        Kings XI Punjab
629  630    2016         Kanpur  21/05/16         Mumbai Indians
630  631    2016        Kolkata  22/05/16  Kolkata Knight Riders
631  632    2016         Raipur  22/05/16       Delhi Daredevils
632  633    2016      Bangalore  24/05/16          Gujarat Lions
633  634    2016          Delhi  25/05/16    Sunrisers Hyderabad
634  635    2016          Delhi  27/05/16          Gujarat Lions
635  636    2016      Bangalore  29/05/16    Sunrisers Hyderabad

                           team2                  toss_winner toss_decision  \
626                Gujarat Lions                Gujarat Lions         field
627             Delhi Daredevils             Delhi Daredevils         field
628      Rising Pune Supergiants              Kings XI Punjab           bat
629                Gujarat Lions                Gujarat Lions         field
630          Sunrisers Hyderabad          Sunrisers Hyderabad         field
631  Royal Challengers Bangalore  Royal Challengers Bangalore         field
632  Royal Challengers Bangalore  Royal Challengers Bangalore         field
633        Kolkata Knight Riders        Kolkata Knight Riders         field
634          Sunrisers Hyderabad          Sunrisers Hyderabad         field
635  Royal Challengers Bangalore          Sunrisers Hyderabad           bat

     result  dl_applied                       winner  win_by_runs  \
626  normal           0                Gujarat Lions            0
627  normal           0             Delhi Daredevils            0
628  normal           0      Rising Pune Supergiants            0
629  normal           0                Gujarat Lions            0
630  normal           0        Kolkata Knight Riders           22
631  normal           0  Royal Challengers Bangalore            0
632  normal           0  Royal Challengers Bangalore            0
633  normal           0          Sunrisers Hyderabad           22
634  normal           0          Sunrisers Hyderabad            0
635  normal           0          Sunrisers Hyderabad            8

     win_by_wickets player_of_match  \
626               6        DR Smith
627               6         KK Nair
628               4        MS Dhoni
629               6        SK Raina
630               0       YK Pathan
631               6         V Kohli
632               4  AB de Villiers
633               0    MC Henriques
634               4       DA Warner
635               0     BCJ Cutting

                                                 venue                umpire1  \
626                                         Green Park           AK Chaudhary
627   Shaheed Veer Narayan Singh International Stadium         A Nand Kishore
628  Dr. Y.S. Rajasekhara Reddy ACA-VDCA Cricket St...        HDPK Dharmasena
629                                         Green Park           AK Chaudhary
630                                       Eden Gardens  KN Ananthapadmanabhan
631   Shaheed Veer Narayan Singh International Stadium         A Nand Kishore
632                              M Chinnaswamy Stadium           AK Chaudhary
633                                   Feroz Shah Kotla              M Erasmus
634                                   Feroz Shah Kotla              M Erasmus
635                              M Chinnaswamy Stadium        HDPK Dharmasena

             umpire2  umpire3
626        CK Nandan      NaN
627     BNJ Oxenford      NaN
628      Nitin Menon      NaN
629        CK Nandan      NaN
630        M Erasmus      NaN
631     BNJ Oxenford      NaN
632  HDPK Dharmasena      NaN
633    C Shamshuddin      NaN
634        CK Nandan      NaN
635     BNJ Oxenford      NaN

In [1]:
# join

In [2]:
#Join Operator

In [5]:
import pandas as pd
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                 index=['K0','K1','K2'])

In [6]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [7]:
right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                  index=['K0','K2','K3'])

In [8]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [9]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [10]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3